---
title: ReactOS 内存管理(上)
date: 2017-06-26 09:15:33
tags:
- ReactOS
- Memory
categories:
- ReactOS
---

上一篇总结了一下用Windbg调试系统调用的过程，暂时总结那么多，后面看到新鲜内容再补充进去。这一篇总结一下内存管理的知识，老规矩依照毛德操老师的书，学习一下基本原理，然后用Windbg调试一下过程，总结一下问题。

之前序言中说到现代操作系统的条件，提供对内核的保护，对不同用户程序之间的隔离，以及允许软件的装入位置浮动。要实现这些一方面要硬件支持，再者要有软件配合，软件的配合就是基于页面映射的“虚拟内存”机制。硬件上完成这个工作的就是MMU，如果没有启用该硬件，那么CPU直接使用物理地址访问内存。如果启用了MMU，那么ALU使用的地址就先要给到MMU，转成物理地址才可以使用。虚拟内存机制为每一个进程准备了相同范围的地址空间，不用的进程各自独立，相同的地址会被MMU映射到不同的物理内存，实现进程间相互隔离；由于虚拟地址与最终的物理地址有映射关系，并且不同进程相互隔离，这样同样的模块可以被映射到相同的地址，而不需要进行重定位；同时CPU的运行被分为用户态和内核态，用户态无法直接操作内核态的内存，这样就将内核保护了起来。基于页面映射的“虚拟内存”机制很自然地就满足了现代操作系统的基本要求。

基于页面映射的“虚拟内存”机制，最基本的一个问题就有一个映射。它就涉及到虚拟地址空间，物理地址“空间”，以及相互之间的关系。引申出来的就是虚拟地址空间管理（保存），物理地址空间管理（保存），虚拟地址空间到物理地址空间的映射关系管理（保存）等问题。按照如下的几个主题总结一下学习的内容：

1. 虚拟内存空间管理
2. 物理内存管理
3. 虚拟地址到物理地址映射
4. 读取其他进程内存的实现方法
5. NtAllocateVirtualMemory分配内存过程
6. 页面异常
7. 页面的换入与换出

> 对于进行过Windows编程，尤其了解过Windows安全相关内容的朋友都知道，PE文件的映射还是比较重要的。毛德操老师分析了映射Data文件的过程，后面专门调试一下PE文件的映射过程，加深认识。

ReactOS的内存管理基本上是基于CPU的MMU的功能展开的，毛老师给总结了MMU的功能，这里抄下来备查：

* 根据虚拟地址计算出该地址所属的页面
* 根据页面映射表其实地址计算出页面映射表所在的物理地址
* 根据物理地址在高速缓存TLB中查找表项内容
* 表项不存在于TLB中，从内存中将其装入TLB中
* 检查表项的PA_PRESENT标志位，如果为1就表示映射的目标为某个物理页面，可以访问这个页面。但是需要进一步检查权限，没有权限访问将引发缺页异常。
* 如果PA_PRESENT标志位为0，说明虚存页面不在内存，当前指令执行会失败，CPU产生页面异常，由异常处理程序进行处理：
	1. 如果页面映射表为0，说明虚存页面还没有映射，检查虚存页面是否落入已分配使用区间。如果是就为其分配物理内存，进行访问。如果不是就属于越界访问，应当引起更高层次出错处理。
	2. 如果整个页面映射表项非0，说明虚存页面映像存在于某个页面倒换文件之中，为其分配物理页面，从倒换文件中读入该页面的映像，页面映射表项修改指向物理页面，然后即可访问。

上面说MMU得到的是虚拟地址，其实不准确。在X86的CPU上，基于页面的映射机制其实是建立在基于段式内存管理基础之上。而在Windows以及Linux上，段机制的段寄存器被设置为指向整个地址空间的GDT表项，结果段式内存管理的线性地址就等于虚拟地址，所以上面就直接说虚拟地址了，以简化语言表达。

<!-- more -->
本篇中会分析NtAllocateVirtualMemory函数，所以自己编写一个程序，用于调试内存分配和释放过程。以AllocMemory.exe进程（VS2008编译通过，ReactOS上可以执行）为例来进行调试。该程序的代码如下代码块所示，具体内容不作解释。

```
#include "stdafx.h"
#include <Windows.h>

int _tmain(int argc, _TCHAR* argv[])
{
	printf("Before VirtualAllocEx!\n");
	system("pause");

	LPVOID pAlloc = VirtualAllocEx(GetCurrentProcess(), NULL, 0x1000, MEM_COMMIT|MEM_RESERVE, PAGE_READWRITE);

	printf("Before Write Content to Alloc Buffer!\n");
	system("pause");
	if (NULL != pAlloc)
	{
		sprintf((CHAR*)pAlloc, "Hello ReactOS!");
	}

	printf("Before Free Buffer!\n");
	system("pause");

	VirtualFreeEx(GetCurrentProcess(), pAlloc, 0x1000, MEM_FREE);

	printf("Before Exit main!\n");
	system("pause");

	return 0;
}
```

#### 虚拟内存空间的管理 ####

在编程中，实际使用的地址都是虚拟内存空间的地址，即虚拟地址。首先简单理一下虚拟内存空间管理的逻辑，这一小节按照毛德操老师书中线索总结一下。

第一个线索是在进程控制块EPROCESS中有一个字段VadRoot，它保存的是进程虚拟地址空间的使用情况。该成员的情况如下，与之前的版本不同的是，VadRoot是一块结构体内存`_MM_AVL_TABLE`，而非一个结构体指针；该结构体内容如下所示，它的第一个成员是BalancedRoot，类型为`MMADDRSS_NODE`结构体。在下面的代码块中给出了这两个结构体具体内容，很显然`MMADDRESS_NODE`结构体就是一个二叉树的节点，分别有左孩子，右孩子节点指针。再后面的两个成员`StartingVpn`和`EndingVpn`现在看并不知道是什么意思，看到后面就知道了，它其实是页目录和页表两个索引拼接，也即将虚拟地址右移12位后剩下的高20位（最高10位用于索引页目录表，中间10位用于索引页表，最低12位为页内偏移）。

```
kd> !process 0 0 AllocMemory.exe
PROCESS b22d6388  SessionId: 0  Cid: 030c    Peb: 7ffdf000  ParentCid: 023c
    DirBase: 3623b000  ObjectTable: e172ad68  HandleCount:   5.
    Image: AllocMemory.exe

kd> dt nt!_EPROCESS b22d6388 -y Vad
   +0x140 VadFreeHint : (null)
   +0x250 VadRoot : _MM_AVL_TABLE

kd> dd b22d6388 +0x250 L1
b22d65d8  b22d65db
kd> dt nt!_MM_AVL_TABLE b22d65d8
   +0x000 BalancedRoot     : _MMADDRESS_NODE 一个结构体，而非指针
   +0x014 DepthOfTree      : 0y00110 (0x6)
   +0x014 Unused           : 0y000
   +0x014 NumberGenericTableElements : 0y000000000000000000011100 (0x1c)
   +0x018 NodeHint         : 0xb22d3448
   +0x01c NodeFreeHint     : (null)
```

```
//
// Memory Manager AVL Table for VADs and other descriptors 用于VAD的内存管理AVL表
//
typedef struct _MM_AVL_TABLE
{
    MMADDRESS_NODE BalancedRoot;				// 二叉树 Root节点，其RightChild才是书根
    ULONG_PTR DepthOfTree:5;					// 二叉树深度
    ULONG_PTR Unused:3;							// 1 内核表，0 用户空间表
#ifdef _WIN64
    ULONG_PTR NumberGenericTableElements:56;
#else
    ULONG_PTR NumberGenericTableElements:24;	// 节点数
#endif
    PVOID NodeHint;
    PVOID NodeFreeHint;
} MM_AVL_TABLE, *PMM_AVL_TABLE;

//
// Node in Memory Manager's AVL Table 内存管理的AVL表中节点定义
//
typedef struct _MMADDRESS_NODE
{
    union
    {
        LONG_PTR Balance:2;
        struct _MMADDRESS_NODE *Parent;
    } u1;
    struct _MMADDRESS_NODE *LeftChild;
    struct _MMADDRESS_NODE *RightChild;
    ULONG_PTR StartingVpn;
    ULONG_PTR EndingVpn;
} MMADDRESS_NODE, *PMMADDRESS_NODE;

```

另外一个使用了`MM_AVL_TABLE`结构体的地方是`MM_AVL_TABLE MiRosKernelVadRoot;`全局变量的定义。MiRosKernelVadRoot是保存了内核中虚拟地址空间管理结构（AVL树根节点）的根节点，与用户空间的VadRoot没什么本质区别。

其实在EPROCESS结构体中还有另外一个成员Vm，它是一个`nt!_MMSUPPORT`结构体。从下面调试器中打印出的内容可以看到这个结构体中记录了当前进程内存使用的基本情况，包括上一次内存修剪时间，页面错误次数，工作机峰值，最大工作集，最小工作集等等（编译为不同的目标平台，以及设置不同的系统版本，结构体内的参数不同，其他的信息不再列出）。

```
kd> dt nt!_EPROCESS b230a710 -y vm
   +0x1e8 Vm : _MMSUPPORT
   +0x240 VmDeleted : 0y0
   +0x240 VmTopDown : 0y0
```

```
kd> dt nt!_MMSUPPORT
   +0x000 WorkingSetExpansionLinks : _LIST_ENTRY
   +0x008 LastTrimTime     : _LARGE_INTEGER
   +0x010 Flags            : _MMSUPPORT_FLAGS
   +0x014 PageFaultCount   : Uint4B
   +0x018 PeakWorkingSetSize : Uint4B
   +0x01c GrowthSinceLastEstimate : Uint4B
   +0x020 MinimumWorkingSetSize : Uint4B
   +0x024 MaximumWorkingSetSize : Uint4B
   +0x028 VmWorkingSetList : Ptr32 _MMWSL
   +0x02c Claim            : Uint4B
   +0x030 NextEstimationSlot : Uint4B
   +0x034 NextAgingSlot    : Uint4B
   +0x038 EstimatedAvailable : Uint4B
   +0x03c WorkingSetSize   : Uint4B
   +0x040 WorkingSetMutex  : _EX_PUSH_LOCK
```

与`MM_AVL_TABLE MiRosKernelVadRoot;`类似，在内核地址中也定义了一个全局的变量`PMMSUPPORT MmKernelAddressSpace;`，它表示了内核的地址空间，当然了它的内容与用户进程的EPRCESS中的Vm一样，表示内容的意义也类似。

实际上在新的ReactOS源码中，对于地址空间的引用是通过Vm成员作为标识的，对于内核地址空间的引用是用MmKernelAddressSpace作为参数。根据源码中对`PMMSUPPORT`类型的引用，可以看到有如下几个对于虚拟内存进行操作的函数，如`MmLocateMemoryAreaByAddress`，`MmLocateMemoryAreaByRegion`，`MmInsertMemoryArea`，`MmFindGap`，`MmFreeMemoryArea`，`MmCreateMemoryArea`等。

其中与书中对应的两个函数是`MmLocateMemoryAreaByAddress`和`MmLocateMemoryAreaByRegion`。从两个函数原型中可以看到两个函数的参数发生了变化，MmLocateMemoryAreaByAddress函数的第一个参数`PMMSUPPORT AddressSpace`表示虚拟地址空间信息的结构体指针，第二个参数`Address_`就是要定位的地址值了。

```
PMEMORY_AREA NTAPI
MmLocateMemoryAreaByAddress(PMMSUPPORT AddressSpace,
							PVOID Address_)

PMEMORY_AREA NTAPI
MmLocateMemoryAreaByRegion(PMMSUPPORT AddressSpace,
                           PVOID Address_,
                           ULONG_PTR Length)
```

