---
title: ReactOS 系统调用
date: 2017-06-20 17:15:33
tags:
- ReactOS
categories:
- ReactOS
---

上一篇文章中已经完成了ReactOS代码的编译，以及安装到虚拟机中，同时也研究了直接用Windbg进行调试的方法。也就是说调试它和调试Windows操作系统无太大差异，接下来就是坚持学习去了。单纯去看源码可能会迷失掉，ReactOS现有版本的代码量已经非常大了，涉及到内容也已经很繁杂，所以基于毛德操老师的《Windows内核情景分析》一书来学习。

后面的N篇文章就作为读书笔记，记录阅读中自认为的重点内容以及自己的一些思考！现在开始第一篇笔记，系统调用。系统调用之前，先简单说一下概述中自认为的重点的内容。

### 概述 ###

系统调用前面是概述内容，这个里面有几个想抄写到这里，作为记录！首先是毛老师在里面提到了现代意义上的操作系统的条件：

* 操作系统在内存中的映像必须受到保护，不会因为用户程序的不良行为而受到伤害
* 不同的用户程序之间也应该互相防护，不能因为一个程序不良行为或误操作而伤害另一个程序
* 除了保护用户数据与程序外，在物理内存中的位置应该可以浮动

再有就是Windows内核的简单描述，关于宏内核和Windows内核的关系，这里直接给出毛老师书中的Windows系统结构图，如图 1。

<div align="center">
![图1 Windows系统结构图](/img/2017-06-20-ReactOS-SystemCall-Windows-Architecture.jpg)
</div>

<!-- more -->

正如书中所述，其实从图上就可以看出，所谓Windows操作系统，至少应该是内核加上系统DLL还有子系统服务进程的总和。

还有几点也需要摘抄过来，对于一些概念的理解有帮助。系统调用界面下面就是Executive，即内核的管理层。管理层又具体分为对象管理，内存管理，进程管理，安全管理，I/O管理等独立模块。有些资料翻译为执行体，其实不太准确，翻译成管理层更容易理解。再者，微软所说的“内核”其实是内核中比较核心的，比较接近底层的一层，包含了设备驱动底层中断处理，异常处理等有关的功能。例如有一个说法，中断处理的内部不允许线程切换，线程切换只有在完成了中断处理以后才能进行，Windows内核规定只有在从所谓的“内核”层退出来时才可以进行线程切换（这里的内核就是不包含Executive的内核，即微软所称的“Kernel”，核心层），更明确一点就是IRQL从`DISPATCH_LEVEL`级别向`APC_LVEL`级别切换时，才会有线程的切换（在`DISPATCH_LEVEL`级别不允许有线程切换动作）。

### 系统调用 ###

系统调用简单说就是从用户程序调用内核层的系统函数，完成一些特定的操作，比如读取文件，写文件，打开驱动，发送网络数据包等。一般用户程序都是运行在Ring3层，而要调用的内核层的系统函数，本身是位于内核层的，这里就涉及到从用户态向内核态切换。

一般说来有三种方式可以将运行于用户空间的CPU转到系统空间：

* 中断（Interrupt）
	外部设备的中断请求到来，CPU会自动转入系统空间，从预定的地址开始执行指令。中断只会在两条指令之间发生，不会使得正在执行的指令半途而废。它属于被动行为，身不由己，完全是不可预测地异步发生。

* 异常(Exception)

        /* Initialize TrapFrame segment registers with sane values */
        mov eax, KGDT_R3_DATA OR 3
        mov ecx, fs
        mov [esp + KTRAP_FRAME_DS], eax		// 38h
        mov [esp + KTRAP_FRAME_ES], eax		// 34h
        mov [esp + KTRAP_FRAME_FS], ecx		// 50h
        mov dword ptr [esp + KTRAP_FRAME_GS], 0	// 30h  GS

    else

        /* Check for V86 mode */
        test byte ptr [esp + KTRAP_FRAME_EFLAGS + 2], (EFLAGS_V86_MASK / HEX(10000))
        jz not_v86_trap

            /* Restore V8086 segments into Protected Mode segments */
            mov eax, [esp + KTRAP_FRAME_V86_DS]
            mov ecx, [esp + KTRAP_FRAME_V86_ES]
            mov [esp + KTRAP_FRAME_DS], eax
            mov [esp + KTRAP_FRAME_ES], ecx
            mov eax, [esp + KTRAP_FRAME_V86_FS]
            mov ecx, [esp + KTRAP_FRAME_V86_GS]
            mov [esp + KTRAP_FRAME_FS], eax
            mov [esp + KTRAP_FRAME_GS], ecx
            jmp set_sane_segs

        not_v86_trap:

            /* Save segment selectors */
            mov eax, ds
            mov ecx, es
            mov [esp + KTRAP_FRAME_DS], eax
            mov [esp + KTRAP_FRAME_ES], ecx
            mov eax, fs
            mov ecx, gs
            mov [esp + KTRAP_FRAME_FS], eax
            mov [esp + KTRAP_FRAME_GS], ecx

    endif

set_sane_segs:
    /* Load correct data segments 加载正确的数据 段寄存器 */
    mov ax, KGDT_R3_DATA OR RPL_MASK
    mov ds, ax
    mov es, ax

    /* Fast system calls have fs already fixed 快速系统调用已经将FS寄存器修正，指向了KPCR 结构体了 */
    if (Flags AND KI_FAST_SYSTEM_CALL)

        /* Enable interrupts and set a sane FS value 开启中断，设置FS值*/
        or dword ptr [esp + KTRAP_FRAME_EFLAGS], EFLAGS_INTERRUPT_MASK
        mov dword ptr [esp + KTRAP_FRAME_FS], KGDT_R3_TEB or RPL_MASK

        /* Set sane active EFLAGS */
        push 2
        popfd

        /* Point edx to the usermode parameters 处理参数，将edx内容加8字节，指向Ring3层的参数列表 */
        add edx, 8
    else
        /* Otherwise fix fs now */
        mov ax, KGDT_R0_PCR
        mov fs, ax
    endif

#if DBG
    /* Keep the frame chain intact */
    mov eax, [esp + KTRAP_FRAME_EIP]		// 68h
    mov [esp + KTRAP_FRAME_DEBUGEIP], eax	// 04h
    mov [esp + KTRAP_FRAME_DEBUGEBP], ebp	// 00h
    mov ebp, esp
#endif

    /* Set parameter 1 (ECX) to point to the frame 将ECX设置为指向 自陷帧 */
    mov ecx, esp

    /* Clear direction flag 清除数据传送方向 */
    cld

ENDM

MACRO(KiCallHandler, Handler)
#if DBG
    /* Use a call to get the return address for back traces */
    call Handler
#else
    /* Use the faster jmp */
    jmp Handler
#endif
    nop
ENDM
```

内核中fs内容被初始化为 30h，转换为GDT的索引为6，如下为GDT索引为6（第七项）的项目的内容，如下，很明显是地址位于0xFFDFF000，范围为0～0x1FFF的内存区块，它内容其实就是`nt!_KPCR`结构体（该内存块中还有其他内容）。解析一下该结构体，如下。TSS的指针位于`nt!_KPCR`结构体0x40的位置。

```
kd> dg 30
                                  P Si Gr Pr Lo
Sel    Base     Limit     Type    l ze an es ng Flags
---- -------- -------- ---------- - -- -- -- -- --------
0030 ffdff000 00001fff Data RW Ac 0 Bg Pg P  Nl 00000c93
```

```
kd> dt nt!_KPCR ffdff000
   +0x000 NtTib            : _NT_TIB
   +0x000 Used_ExceptionList : 0xf70c1c1c _EXCEPTION_REGISTRATION_RECORD
   +0x004 Used_StackBase   : (null)
   +0x008 Spare2           : (null)
   +0x00c TssCopy          : 0x8069d000
   +0x010 ContextSwitches  : 0x5459e3
   +0x014 SetMemberCopy    : 1
   +0x018 Used_Self        : 0x7ffdf000
   +0x01c SelfPcr          : 0xffdff000 _KPCR	// 即_KPCR在内存中的地址，本次调试中即 0xffdff000。
   +0x020 Prcb             : 0xffdff120 _KPRCB	// 它的位置在_KPCR结构体基址 + 0x120 的位置上
   +0x024 Irql             : 0 ''
   +0x028 IRR              : 0
   +0x02c IrrActive        : 0
   +0x030 IDR              : 0xffff2078
   +0x034 KdVersionBlock   : 0x8058f248
   +0x038 IDT              : 0x806a0400 _KIDTENTRY
   +0x03c GDT              : 0x806a0000 _KGDTENTRY
   +0x040 TSS              : 0x8069d000 _KTSS
   +0x044 MajorVersion     : 1
   +0x046 MinorVersion     : 1
   +0x048 SetMember        : 1
   +0x04c StallScaleFactor : 0xead
   +0x050 SpareUnused      : 0 ''
   +0x051 Number           : 0 ''
   +0x052 Spare0           : 0 ''
   +0x053 SecondLevelCacheAssociativity : 0 ''
   +0x054 VdmAlert         : 0
   +0x058 KernelReserved   : [14] 0
   +0x090 SecondLevelCacheSize : 0
   +0x094 HalReserved      : [16] 0
kd> dt nt!_KPRCB 0xffdff120
   +0x000 MinorVersion     : 1
   +0x002 MajorVersion     : 1
   +0x004 CurrentThread    : 0xb22bdc30 _KTHREAD
   +0x008 NextThread       : (null) 
   +0x00c IdleThread       : 0x80599370 _KTHREAD
   +0x010 Number           : 0 ''
   +0x011 Reserved         : 0 ''
   +0x012 BuildType        : 3
   +0x014 SetMember        : 1
   +0x018 CpuType          : 0x6 ''
   +0x019 CpuID            : 0x1 ''
   +0x01a CpuStep          : 0xa09
   +0x01c ProcessorState   : _KPROCESSOR_STATE
   +0x33c KernelReserved   : [16] 0
   +0x37c HalReserved      : [16] 0
   +0x3bc PrcbPad0         : [92]  ""
   +0x418 LockQueue        : [33] _KSPIN_LOCK_QUEUE
   +0x520 NpxThread        : (null) 
   +0x524 InterruptCount   : 0x26c2
   +0x528 KernelTime       : 0x1284
   +0x52c UserTime         : 0x3f
   +0x530 DpcTime          : 3
   +0x534 DebugDpcTime     : 0
   +0x538 InterruptTime    : 0x65
   +0x53c AdjustDpcThreshold : 7
   +0x540 PageColor        : 0
   +0x544 SkipTick         : 0 ''
   +0x545 DebuggerSavedIRQL : 0 ''
   +0x546 NodeColor        : 0 ''
   +0x547 Spare1           : 0 ''
   +0x548 NodeShiftedColor : 0
   +0x54c ParentNode       : 0x805b0e40 _KNODE
   +0x550 MultiThreadProcessorSet : 1
   +0x554 MultiThreadSetMaster : 0xffdff120 _KPRCB
   +0x558 SecondaryColorMask : 0x3f
   +0x55c Sleeping         : 0
   +0x560 CcFastReadNoWait : 0
   +0x564 CcFastReadWait   : 0
   +0x568 CcFastReadNotPossible : 0
   +0x56c CcCopyReadNoWait : 0
   +0x570 CcCopyReadWait   : 0
   +0x574 CcCopyReadNoWaitMiss : 0
   +0x578 KeAlignmentFixupCount : 0
   +0x57c SpareCounter0    : 0
   +0x580 KeDcacheFlushCount : 0
   +0x584 KeExceptionDispatchCount : 0x291
   +0x588 KeFirstLevelTbFills : 0
   +0x58c KeFloatingEmulationCount : 0
   +0x590 KeIcacheFlushCount : 0
   +0x594 KeSecondLevelTbFills : 0
   +0x598 KeSystemCalls    : 0x5f4c69
   +0x59c IoReadOperationCount : 0
   +0x5a0 IoWriteOperationCount : 0
   +0x5a4 IoOtherOperationCount : 0
   +0x5a8 IoReadTransferCount : _LARGE_INTEGER 0x0
   +0x5b0 IoWriteTransferCount : _LARGE_INTEGER 0x0
   +0x5b8 IoOtherTransferCount : _LARGE_INTEGER 0x0
   +0x5c0 SpareCounter1    : [8] 0
   +0x5e0 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x660 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x760 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x860 PacketBarrier    : 0
   +0x864 ReverseStall     : 0
   +0x868 IpiFrame         : (null) 
   +0x86c PrcbPad2         : [52]  ""
   +0x8a0 CurrentPacket    : [3] (null) 
   +0x8ac TargetSet        : 0
   +0x8b0 WorkerRoutine    : (null) 
   +0x8b4 IpiFrozen        : 0
   +0x8b8 PrcbPad3         : [40]  ""
   +0x8e0 RequestSummary   : 0
   +0x8e4 SignalDone       : (null) 
   +0x8e8 PrcbPad4         : [56]  ""
   +0x920 DpcData          : [2] _KDPC_DATA
   +0x948 DpcStack         : 0xf7981000 
   +0x94c MaximumDpcQueueDepth : 4
   +0x950 DpcRequestRate   : 0
   +0x954 MinimumDpcRate   : 3
   +0x958 DpcInterruptRequested : 0 ''
   +0x959 DpcThreadRequested : 0 ''
   +0x95a DpcRoutineActive : 0 ''
   +0x95b DpcThreadActive  : 0 ''
   +0x95c PrcbLock         : 0
   +0x960 DpcLastCount     : 0x1ee0
   +0x964 TimerHand        : 0xc2
   +0x968 TimerRequest     : 0
   +0x96c DpcThread        : (null) 
   +0x970 DpcEvent         : _KEVENT
   +0x980 ThreadDpcEnable  : 0 ''
   +0x981 QuantumEnd       : 0 ''
   +0x982 PrcbPad50        : 0 ''
   +0x983 IdleSchedule     : 0 ''
   +0x984 DpcSetEventRequest : 0
   +0x988 PrcbPad5         : [18]  ""
   +0x99c TickOffset       : 0
   +0x9a0 CallDpc          : _KDPC
   +0x9c0 PrcbPad7         : [8] 0
   +0x9e0 WaitListHead     : _LIST_ENTRY [ 0xffdffb00 - 0xffdffb00 ]
   +0x9e8 ReadySummary     : 0x101
   +0x9ec QueueIndex       : 1
   +0x9f0 DispatcherReadyListHead : [32] _LIST_ENTRY [ 0xb2695b78 - 0xb2695b78 ]
   +0xaf0 DeferredReadyListHead : _SINGLE_LIST_ENTRY
   +0xaf4 PrcbPad72        : [11] 0
   +0xb20 ChainedInterruptList : (null) 
   +0xb24 LookasideIrpFloat : 512
   +0xb28 MmPageFaultCount : 0
   +0xb2c MmCopyOnWriteCount : 0
   +0xb30 MmTransitionCount : 242
   +0xb34 MmCacheTransitionCount : 0
   +0xb38 MmDemandZeroCount : 7575
   +0xb3c MmPageReadCount  : 0
   +0xb40 MmPageReadIoCount : 0
   +0xb44 MmCacheReadCount : 0
   +0xb48 MmCacheIoCount   : 0
   +0xb4c MmDirtyPagesWriteCount : 0
   +0xb50 MmDirtyWriteIoCount : 0
   +0xb54 MmMappedPagesWriteCount : 0
   +0xb58 MmMappedWriteIoCount : 0
   +0xb5c SpareFields0     : [1] 0
   +0xb60 VendorString     : [13]  "GenuineIntel"
   +0xb6d InitialApicId    : 0 ''
   +0xb6e LogicalProcessorsPerPhysicalProcessor : 0x1 ''
   +0xb70 MHz              : 0xd40
   +0xb74 FeatureBits      : 0x20033fff
   +0xb78 UpdateSignature  : _LARGE_INTEGER 0x19`00000000
   +0xb80 IsrTime          : _LARGE_INTEGER 0x0
   +0xb88 SpareField1      : _LARGE_INTEGER 0x0
   +0xb90 NpxSaveArea      : _FX_SAVE_AREA
   +0xda0 PowerState       : _PROCESSOR_POWER_STATE
```

```
kd> dt nt!_KTSS
   +0x000 Backlink         : Uint2B
   +0x002 Reserved0        : Uint2B
   +0x004 Esp0             : Uint4B
   +0x008 Ss0              : Uint2B
   +0x00a Reserved1        : Uint2B
   +0x00c NotUsed1         : [4] Uint4B
   +0x01c CR3              : Uint4B
   +0x020 Eip              : Uint4B
   +0x024 EFlags           : Uint4B
   +0x028 Eax              : Uint4B
   +0x02c Ecx              : Uint4B
   +0x030 Edx              : Uint4B
   +0x034 Ebx              : Uint4B
   +0x038 Esp              : Uint4B
   +0x03c Ebp              : Uint4B
   +0x040 Esi              : Uint4B
   +0x044 Edi              : Uint4B
   +0x048 Es               : Uint2B
   +0x04a Reserved2        : Uint2B
   +0x04c Cs               : Uint2B
   +0x04e Reserved3        : Uint2B
   +0x050 Ss               : Uint2B
   +0x052 Reserved4        : Uint2B
   +0x054 Ds               : Uint2B
   +0x056 Reserved5        : Uint2B
   +0x058 Fs               : Uint2B
   +0x05a Reserved6        : Uint2B
   +0x05c Gs               : Uint2B
   +0x05e Reserved7        : Uint2B
   +0x060 LDT              : Uint2B
   +0x062 Reserved8        : Uint2B
   +0x064 Flags            : Uint2B
   +0x066 IoMapBase        : Uint2B
   +0x068 IoMaps           : [1] _KiIoAccessMap
   +0x208c IntDirectionMap  : [32] UChar
```

从上述的内容可知，KiEnterTrap 在系统调用中就是构建了自陷帧，这个自陷帧的整体结构是什么样的呢？下面给出它的内容。其实代码中能看到的构建动作就是从0x64和0x78两个地方为界的两个不同块。对于INT 2Eh自陷指令，0x68～0x78这些系统栈内容是由指令自动入栈的；对于快速系统调用SYSENTER，它则不会负责这些内容，那就是上面看到的汇编代码中故意构建的自陷帧。至于V86模式的那个内容，目前不在考虑范围内。下面给出了本次调试中，各个字段对应的值，如下代码块所示。将其中的Edx字段做个验证，证明是从上面ReadFile函数中调用下来的，如下代码块中内容所示。

```
kd> dt nt!_KTRAP_FRAME 0xf70c1d64
   +0x000 DbgEbp           : 0x12f7d4
   +0x004 DbgEip           : 0x7c92c8de
   +0x008 DbgArgMark       : 0x12f788
   +0x00c DbgArgPointer    : 0
   +0x010 TempSegCs        : 0
   +0x014 TempEsp          : 0
   +0x018 Dr0              : 0
   +0x01c Dr1              : 0
   +0x020 Dr2              : 0
   +0x024 Dr3              : 0
   +0x028 Dr6              : 0x23
   +0x02c Dr7              : 0x23
   +0x030 SegGs            : 0
   +0x034 SegEs            : 0x23
   +0x038 SegDs            : 0x23
   +0x03c Edx              : 0x12f788
   +0x040 Ecx              : 0x8069d000
   +0x044 Eax              : 0xbf
